xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
/*  Copyright (c) 2003-2017, LogMeIn, Inc. All rights reserved.
    This is part of Xively C library. */

#include <xively.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "../cbor/cbor.h"
#include "../cbor/cn-cbor/cn-cbor.h"
#include "../sha256/sha256.h"
#include "xi_sft.h"

/* Simpelink EXT lib includes */
#include "flc_api.h"

#include "hw_memmap.h"
#include "hw_common_reg.h"
#include "hw_types.h"
#include "hw_ints.h"
#include "interrupt.h"
#include "rom.h"
#include "rom_map.h"
#include "uart.h"
#include "prcm.h"
#include "utils.h"
#include "gpio.h"
#include "gpio_if.h"

#include "uart_if.h"
#define  UART_PRINT  Report
#undef   printf
#define  printf      Report

extern int readBootinfo();

///// Test these individually
#define MAX_INCOMING_FILENAME_LENGTH 50
#define MAX_STRING_LENGTH 50

//
// TYPEDEFS
//
typedef unsigned char uchar;
typedef unsigned int uint;

typedef struct file_download_ctx_s
{
    int file_length;
    int result;

    long file_handle;
    unsigned long file_token;

    char file_name[MAX_STRING_LENGTH];
    char file_revision[MAX_STRING_LENGTH];
    unsigned char file_sft_fingerprint[MAX_STRING_LENGTH];
    unsigned char file_local_computed_fingerprint[32];

    SHA256_CTX sha256_context;

} file_download_ctx_t;

typedef struct xi_sft_file_chunk_s
{
    uint offset;
    uint chunk_length;
    uint array_length;
    uint status;
    unsigned char* byte_array;
} xi_sft_file_chunk_t;

//
// VARIABLES
//
int offset = 0;
int downloading = 0;

int tenpercent = 0;
int currenttenpercent = 0;

char filename[] = "xively_firmware_updates.bin";
char file_current_revision[MAX_STRING_LENGTH] = "0.0";
char incomingFilename[MAX_INCOMING_FILENAME_LENGTH] ="";

int idx;

file_download_ctx_t download_context;

char buffer[400];

#define MESSAGESIZE 50
char message[MESSAGESIZE];
#define DETAILSSIZE 400
char details[DETAILSSIZE];

char xi_stopic[128];
char xi_logtopic[128];
char xi_ctopic[128];



void xi_parse_file_update_available( xi_context_handle_t in_context_handle, cn_cbor *cb );


void xi_publish_file_info( xi_context_handle_t in_context_handle );
void xi_publish_file_chunk_request( xi_context_handle_t in_context_handle, const char* file_name, const char* file_revision, int offset );

void xi_process_file_chunk( xi_context_handle_t in_context_handle, cn_cbor* in_cb );
int xi_parse_file_chunk( cn_cbor* in_cb, xi_sft_file_chunk_t* out_sft_file_chunk );

void print_hash(unsigned char hash[])
{
   int idx;
   for (idx=0; idx < 32; idx++)
      printf("%02x",hash[idx]);
   printf("\n");
}

//****************************************************************************
//
//! Reboot the MCU by requesting hibernate for a short duration
//!
//! \return None
//
//****************************************************************************
static void RebootMCU()
{

  //
  // Configure hibernate RTC wakeup
  //
  PRCMHibernateWakeupSourceEnable(PRCM_HIB_SLOW_CLK_CTR);

  //
  // Delay loop
  //
  MAP_UtilsDelay(8000000);

  //
  // Set wake up time
  //
  PRCMHibernateIntervalSet(330);

  //
  // Request hibernate
  //
  PRCMHibernateEnter();

  //
  // Control should never reach here
  //
  while(1)
  {

  }
}

void on_sft_message( xi_context_handle_t in_context_handle,
                            xi_sub_call_type_t call_type,
                            const xi_sub_call_params_t* const params,
                            xi_state_t state,
                            void* user_data )
{
    cn_cbor *cb = NULL;
    char *bufptr = NULL;
    int i = 0 ;
    cn_cbor* cb_item = NULL;
    const uint8_t* payload_data = NULL;
    size_t payload_length = 0;
    int retVal;

    switch ( call_type )
    {
        case XI_SUB_CALL_SUBACK:
            if ( params->suback.suback_status == XI_MQTT_SUBACK_FAILED )
            {
                printf( "topic:%s. Subscription failed.\n", params->suback.topic );
            }
            else
            {
                printf( "topic:%s. Subscription granted %d.\n", params->suback.topic,
                        ( int )params->suback.suback_status );
            }
            return;
        case XI_SUB_CALL_MESSAGE:
            //printf( "topic:%s. message received.\n", params->message.topic );

            /* get the payload parameter that contains the data that was sent. */
            payload_data = params->message.temporary_payload_data;
            payload_length = params->message.temporary_payload_data_length;

            /* Figure out what the packet type is and then call the appropriate parser */
            cb = cn_cbor_decode(payload_data, payload_length, 0);

            if (cb) {
#ifdef XI_DEBUGSFT
                dump(cb, buffer, &bufend, 0);
                *bufend = 0;
                printf("%s\n", buffer);
#endif

                cb_item = cn_cbor_mapget_string(cb, "msgtype");
                if(cb_item)
                {
                    switch(cb_item->v.uint)
                    {
                        case XI_FILE_UPDATE_AVAILABLE:

							printf("Got FILE_UPDATE_AVAILABLE\n");
							if( downloading )
							{
							    printf("WARNING: ALREADY DOWNLOADING!\n");
							    cn_cbor_free(cb CBOR_CONTEXT_PARAM);
							    break;
							}

                            //
                            // Parse FILE_UPDATE_AVAILABLE messsage
                            // and format GET_FILE_CHUNK message into the outgoing cbor buffer `encoded`
                            //
                            xi_parse_file_update_available( in_context_handle, cb );

                            //
                            // Free the incoming cbor message context
                            //
                            cn_cbor_free(cb CBOR_CONTEXT_PARAM);

                            //
                            // Log the FILE_UPDATE_AVAILABLE information
                            //
                            printf("logging file update available\n");
                            snprintf(message,sizeof(message),"FILE_UPDATE_AVAILABLE");
                            bufptr = download_context.file_sft_fingerprint;
                            for(i=0;i<32;i++)
                            {
                                bufptr += sprintf(bufptr,"%02x", download_context.file_sft_fingerprint[i]);
                            }
                            *bufptr = '\0';
                            snprintf(message,sizeof(message),"File update available");
                            snprintf(details,sizeof(details),"name=%s revision=%s length = %d fingerprint = %s"
                                    ,filename, download_context.file_revision, download_context.file_length, download_context.file_sft_fingerprint );
                            snprintf(buffer,sizeof(buffer),"{\"message\":\"%s\",\"severity\":\"notice\",\"details\":\"%s\"}",message,details);
                            xi_publish( in_context_handle, xi_logtopic, buffer, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );

                            //
                            // Initialize sha256 digest of the file and tracking variables
                            //
                            sha256_init( &download_context.sha256_context );
                            offset = 0;

                            //
                            // Open the file for writing
                            //
                            retVal =  sl_extlib_FlcOpenFile("/sys/mcuimgA.bin", download_context.file_length, &download_context.file_token, &download_context.file_handle, FS_MODE_OPEN_WRITE);

                            //
                            // Check for errors
                            //
                            if( retVal < 0 )
                            {
                                printf(" ERROR: mcuimgA.bin open returned %d\n",retVal);
                                download_context.result = -1;
                                downloading = 0;
                            }
                            break;

