xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
}

void xi_process_file_chunk( xi_context_handle_t in_context_handle, cn_cbor *cb )
{
    cn_cbor *cb_item;
    unsigned chunkoffset = 0;
    int retval;

    xi_sft_file_chunk_t file_chunk_data;
    if( 0 != xi_parse_file_chunk( cb, &file_chunk_data ) )
    {
        downloading = 0;
        return;
    }

    /* printf( "---- FILE_CHUNK: length = %d FILE_LENGTH: %d\n", file_chunk_data.chunk_length, download_context.file_length ); */

    // Save the offset for THIS fine chunk
    chunkoffset = offset;

    // Build the offset for the NEXT file chunk
    offset += file_chunk_data.chunk_length;

    if(currenttenpercent < offset)
    {
        /* Yes, I know this is terrible, but it's the level of effort appropriate to the task. */
        printf("Downloaded %d bytes %d %%  of the file \n",offset, (100 * (currenttenpercent + 1000)) / download_context.file_length );
        currenttenpercent += tenpercent;
    }

    if( file_chunk_data.array_length )
    {
        int writelength = file_chunk_data.array_length;
        if( chunkoffset + file_chunk_data.array_length > download_context.file_length )
        {
            writelength = download_context.file_length - chunkoffset ;
            downloading = 0;
        }

        sha256_update( &download_context.sha256_context, (unsigned char *) file_chunk_data.byte_array, file_chunk_data.array_length );

        int write_length = (int) file_chunk_data.array_length;
        if( 0 > write_length )
        {
            // WriteBuffer is too large for CC3200 sl_extlib_FlcWriteFile operations
            // TODO: report error to SFT!
            printf("ERROR: WriteBuffer is too large for CC3200 sl_extlib_FlcWriteFile operations\n");
            download_context.result = -1;
            retval = 0;
            downloading = 0;
        }
        else
        {
            retval = sl_extlib_FlcWriteFile( download_context.file_handle, chunkoffset, (unsigned char *) file_chunk_data.byte_array, write_length );
            if( retval < 0  )
            {
                // Write Failed
                // TODO: Report Error to SFT!
                printf("ERROR: Write Returned error code: %d\n", retval );
                download_context.result = -1;
                downloading = 0;
            }
            else if( (chunkoffset + file_chunk_data.array_length ) >= download_context.file_length )
            {
                downloading = 0;
            }
        }
    }
    else
    {
        // Zero Length Write Buffer
        // TODO: Report Error!
        printf("ERROR: Write Buffer from SFT is of zero length\n" );
        download_context.result = -1;
        downloading = 0;
    }

    //
    // TODO: check for status of 1 for EoF
    //
    if( file_chunk_data.status > 1 )
    {
        printf("ERROR: SFT packet reported Chunk Status Request Error: %d\n", cb_item->v.uint );
        download_context.result = -1;
        downloading = 0;
        // sl_extlib_FlcCloseFile( download_context.file_token, NULL, NULL, 0 );
    }

    if( 1 == downloading )
    {
        xi_publish_file_chunk_request( in_context_handle, incomingFilename, download_context.file_revision, offset );
		/* Let's try making a GET_CHUNK packet */
    }
}

int
xi_sft_init(xi_context_handle_t in_context_handle, char *account_id, char *device_id) {
	int r = -1;

	readBootinfo();
	// Accept the latest firmware if we get here.
	if( sl_extlib_FlcIsPendingCommit() )
	{
	    printf("******************* Committing this revision\n");
	    sl_extlib_FlcCommit(FLC_COMMITED);
	}

	readBootinfo();

	if(NULL == account_id) return(-1);
	if(NULL == device_id) return(-1);

	// xi_stopic is the MQTT topic we PUB to to send messages to the broker.
	snprintf(xi_stopic, sizeof(xi_stopic),"xi/ctrl/v1/%s/svc", device_id);

	// xi_ctopic is the MQTT topic we SUBSCRIBE to to receive messages from the broker.
	snprintf(xi_ctopic, sizeof(xi_ctopic),"xi/ctrl/v1/%s/cln", device_id);

	// xi_logtopic is the MQTT topic we PUB to to add log messages.
	snprintf(xi_logtopic, sizeof(xi_logtopic),"xi/blue/v1/%s/d/%s/_log",account_id, device_id);

	// Everything interesting happens in the on_sft_message() state machine.
	r = xi_subscribe(in_context_handle, xi_ctopic, XI_MQTT_QOS_AT_MOST_ONCE, on_sft_message, 0 );
	printf("xi_subscribe() topic: %s returns %d\n",xi_ctopic, r);

	return(0);
}


// Functions useful for debugging:
#ifdef XI_DEBUGSFT
void dump(const cn_cbor* cb, char* out, char** end, int indent) {
    int i;
    cn_cbor* cp;
    char finchar = ')';           /* most likely */

#define CPY(s, l) memcpy(out, s, l); out += l;
#define OUT(s) CPY(s, sizeof(s)-1)
#define PRF(f, a) out += sprintf(out, f, a)

    if (!cb)
        goto done;

    for (i = 0; i < indent; i++) *out++ = ' ';
    switch (cb->type) {
        case CN_CBOR_TEXT_CHUNKED:   OUT("(_\n");                  goto sequence;
        case CN_CBOR_BYTES_CHUNKED:  OUT("(_\n\n");                goto sequence;
        case CN_CBOR_TAG:            PRF("%ld(\n", cb->v.sint);    goto sequence;
        case CN_CBOR_ARRAY:  finchar = ']'; OUT("[\n");            goto sequence;
        case CN_CBOR_MAP:    finchar = '}'; OUT("{\n");            goto sequence;
        sequence:
            for (cp = cb->first_child; cp; cp = cp->next) {
                dump(cp, out, &out, indent+2);
            }
            for (i=0; i<indent; i++) *out++ = ' ';
            *out++ = finchar;
            break;
        case CN_CBOR_BYTES:   OUT("h'\n");
            for (i=0; i<cb->length; i++) {
                PRF("%02x ", cb->v.str[i] & 0xff);
            }

            *out++ = '\'';
            break;
        case CN_CBOR_TEXT:    *out++ = '"';
            CPY(cb->v.str, cb->length); /* should escape stuff */
            *out++ = '"';
            break;
        case CN_CBOR_NULL:   OUT("null");                      break;
        case CN_CBOR_TRUE:   OUT("true");                      break;
        case CN_CBOR_FALSE:  OUT("false");                     break;
        case CN_CBOR_UNDEF:  OUT("simple(23)");                break;
        case CN_CBOR_INT:    PRF("%ld", cb->v.sint);           break;
        case CN_CBOR_UINT:   PRF("%lu", cb->v.uint);           break;
        case CN_CBOR_DOUBLE: PRF("%e", cb->v.dbl);             break;
        case CN_CBOR_SIMPLE: PRF("simple(%ld)", cb->v.sint);   break;
        default:             PRF("???%d???", cb->type);        break;
    }
    *out++ = '\n';
done:
    *end = out;
}
#endif
